{
  "linkedin": "https://www.linkedin.com/in/faisalahmed92/",
  "gmail": "mailto:faisalg2006@gmail.com",
  "introduction": "With over 12 years of experience in the embedded systems domain, I specialize in system testing, automation, and data analytics. My career includes a strong foundation in software development, where I have designed and led \ntest automation frameworks, validated complex algorithms, and managed data pipelines. I have a deep understanding of \nthe software development lifecycle (SDLC), system testing lifecycle (STLC), and am proficient in communication \nprotocols. I am passionate about leading teams and mentoring engineers while continuing to develop technical expertise \nacross multiple domains, including automotive, transport refrigeration, and telematics.",
  "key_skills": {
    "Data Analysis & Visualization": "Skilled in data cleaning, analysis, and visualization, ensuring actionable insights are derived from complex datasets.",
    "System Testing & Automation": "Expertise in both manual and automated system testing for embedded systems, with a focus on quality assurance and process optimization",
    "Test Automation Frameworks (Python)": "Experience in designing and implementing test automation frameworks using  Python to enhance testing efficiency and coverage.",
    "Algorithm Validation & Data Pipeline Maintenance": "Validated algorithms for ad systems and maintained data pipelines for real-time data processing.",
    "IoT & Data Acquisition Systems": "Proficient in working with IoT devices (Raspberry Pi, Arduino) and Data Acquisition Systems (MCC DAQ) for real-time monitoring and data collection.",
    "HIL & ECU Testing": "Hands-on experience with Hardware-in-the-Loop (HIL) testing and Electronic Control Unit (ECU) testing, ensuring the robustness of embedded systems in automotive applications.",
    "Communication Protocols":"Knowledge of various communication protocols such as CAN, LIN, Ethernet, and Modbus for system integration.",
    "SDLC & STLC": "Strong understanding of the Software Development Life Cycle (SDLC) and Software Testing Life Cycle (STLC), ensuring efficient development and testing processes",
    "Test Planning & Documentation": "Experienced in creating test plans, DVP&R, and detailed test cases to meet system specifications and requirements."
  }
}
